In [28]:
from IPython.display import display, HTML
display(HTML("""
<style>
div.container{width:90% !important;}
div.cell.code_cell.rendered{width:100%;}
div.input_prompt{padding:0px;}
div.CodeMirror {font-family:Consolas; font-size:12pt;}
div.text_cell_render.rendered_html{font-size:12pt;}
div.output {font-size:12pt; font-weight:bold;}
div.input {font-family:Consolas; font-size:12pt;}
div.prompt {min-width:70px;}
div#toc-wrapper{padding-top:120px;}
div.text_cell_render ul li{font-size:12pt;padding:5px;}
table.dataframe{font-size:12px;}
</style>
"""))

<b><font size= "6" color="red">ch15.데이터베이스 연동</font></b> 
# 1절 SQLite 데이터베이스 연결
- SQLite 데이터 베이스는 별도의 DBMS없이 SQL문 이용해서 DB액세스할 수 있도록 만든 간단한 디스크 기반 DB
- C라이브러리
- SQLite는 프로토타입 생성시 사용
- 프로젝트: 분석 ->  설계 ->  구현  -> 테스트  ->  고객에게 배포  ->  유지보수
            프로토타입(SQLite)     완제품(Oracle, MySQL, Maria, ...)
- DB browswe for SQLite
## 1.1 SQLite browser 설치 및 sqlite 패키지 load

In [2]:
import sqlite3
sqlite3.sqlite_version

'3.40.1'

In [3]:
import pandas as pd
pd.__version__

'1.5.3'

## 1.2 데이터 베이스 연결
```
(1) 데이터베이스 연결 생성
(2) SQL전송 객체(cursor)
(3) SQL전송 & 결과 받기(cursor.execute()이용)
(4) cursor 해제 & 데이터베이스 연결객체 해제
```

In [5]:
# (1) DB연결: sqlite로 연결 시 db파일이 없으면 빈 DB파일 생성, 있을 시 그냥 연결
conn= sqlite3.connect('data/ch15_example.db')

In [6]:
# (2) SQL 전송 객체 생성(cursor 객체)
cursor= conn.cursor()
cursor

In [10]:
cursor.execute('''
    CREATE TABLE MEMBER(
        NAME TEXT,
        AGE INT,
        EMAIL TEXT
    )
''')

OperationalError: table MEMBER already exists

In [11]:
cursor.execute("insert into member values('홍길동', 20, 'h@h.com')")
print('수행결과행수: ', cursor.rowcount)

수행결과행수:  1

In [13]:
sql= "INSERT INTO MEMBER VALUES ('김길동',30,'k@k.com')"
cursor.execute(sql)
print('수행결과행수: ', cursor.rowcount)
cursor.execute("INSERT INTO MEMBER VALUES ('이길동',25,'l@l.com')")
print('수행결과행수: ', cursor.rowcount)

수행결과행수:  1
수행결과행수:  1

In [26]:
conn.commit() # (반)conn.rollback()

In [23]:
#select 전송결과: cursor가 가르킴
cursor.execute("SELECT * from member")

In [25]:
# insert, update, delete문 실행결과: cursor.rowcount
# select문 실행결과:
        ## fetchall(): 결과를 모두 받을 때 (튜플list)
        ## fetcone(): 결과를 한 행씩 받을 때 (튜플)
print(cursor.fetchall()) # 한 번 소요된 cursor 객체는 다시 fetch될 수 없음

[]

In [39]:
cursor.execute("SELECT * from member order by age")
members=cursor.fetchall()

In [40]:
for member in members:
    print(member)

('홍길동', 20, 'h@h.com')
('이길동', 25, 'l@l.com')
('김길동', 30, 'k@k.com')

In [43]:
cursor.execute("SELECT * from member order by age")
members= []
while True:
    member= cursor.fetchone()
    if member is None:
        print('데이터 끝')
        break
        
    members.append(members)

데이터 끝

In [44]:
members

[[...], [...], [...]]

In [46]:
# 최상위 n행 읽기
cursor.execute("SELECT * from member order by age")
for member in cursor.fetchmany(2):
    print(member)

('홍길동', 20, 'h@h.com')
('이길동', 25, 'l@l.com')

In [48]:
cursor.description

(('NAME', None, None, None, None, None, None),
 ('AGE', None, None, None, None, None, None),
 ('EMAIL', None, None, None, None, None, None))

In [11]:
class Member:
    'Member 테이블의 내용을 받을 객체 타입'
    def __init__(self, name, age, email):
        self.name= name
        self.age= age
        self.email= email
    def __str__(self):
        return f"{self.name}\t{self.age}\t{self.email}"
def to_member(*row): #튜플매개변수를 받아 Member형 객체를 return
    return Member(row[0],row[1],row[2])

In [53]:
member= to_member('홍길동',20, 'h@h.com')
print(member)

홍길동	20	h@h.com

In [55]:
cursor.execute('select * from member')
member_list=[] #sql수행한 결과를 담을 객체 list
members= cursor.fetchall()

for member in members:
    member_list.append(to_member(*member))

('이길동', 25, 'l@l.com')

In [56]:
for member in member_list:
    print(member)

홍길동	20	h@h.com
김길동	30	k@k.com
이길동	25	l@l.com

In [59]:
# (4) 연결 해제
cursor.close()
conn.close()

ProgrammingError: Cannot operate on a closed database.

## 1.3 SQL 구문에 파라미터 사용하기
- qmark (DB에 따라 불가한 경우 있음)
- named(추천)

In [3]:
conn= sqlite3.connect('data/ch15_example.db')
cursor= conn.cursor()
cursor.execute("SELECT * from member where name in ('홍길동', '김길동')")
cursor.fetchall()

[('홍길동', 20, 'h@h.com'), ('김길동', 30, 'k@k.com')]

In [4]:
# 파라미터 사용하기: qmark 방법 
name1= input('검색할 이름1? ')
name2= input('검색할 이름2? ')
# cursor.execute("SELECT * from member where name in ('"+name1+"', '"+name2+"')")
# cursor.execute(f"SELECT * from member where name in ('{name1}', '{name2}')")
cursor.execute("SELECT * from member where name in (?, ?)",(name1, name2))
cursor.fetchall()

검색할 이름1? 이희성
검색할 이름2? 이희성

[]

In [5]:
# 파라미터 사용하기: named 방법
name1= input('검색할 이름1? ')
name2= input('검색할 이름2? ')
cursor.execute("SELECT * from member where name in (:name1, :name2)", {"name1": name1, "name2":name2})
cursor.fetchall()

검색할 이름1? 이희성
검색할 이름2? 이희성

[]

In [6]:
#Member 테이블에 입력(사용자로부터 이름, 나이, 메일을 받아 insert)
try:
    name= input('입력할 이름: ')
    age= int(input('입력할 나이: '))
except:
    print('유효하지 않은 나이를 입력한 경우, 18세로 초기화')
    age=18
finally:
    email= input('입력할 메일은: ')

inputdata= {'name':name, 'age':age, 'email':email}
inputdata2= (name, age, email) #qmark방식에서 사용

sql= "INSERT INTO MEMBER VALUES (:name, :age, :email)"

cursor.execute(sql, inputdata)
conn.commit()
if cursor.rowcount:
    print('저장완료')
else:
    print('저장안됨')

입력할 이름: 홍길동
입력할 나이: 22
입력할 메일은: h@h.com
저장완료

In [12]:
#Member 테이블에 입력(사용자로부터 이름, 나이, 메일을 받아 insert)
try:
    name= input('입력할 이름: ')
    age= int(input('입력할 나이: '))
except:
    print('유효하지 않은 나이를 입력한 경우, 18세로 초기화')
    age=18
finally:
    email= input('입력할 메일은: ')


newMember= Member(name, age, email) #qmark방식에서 사용

sql= "INSERT INTO MEMBER VALUES (:name, :age, :email)"
cursor.execute(sql, newMember.__dict__)
conn.commit()
if cursor.rowcount ==1:
    print('입력성공')

입력할 이름: 유관순
입력할 나이: ㅁ
유효하지 않은 나이를 입력한 경우, 18세로 초기화
입력할 메일은: y@y.com
입력성공

In [19]:
#Member 테이블에 입력(사용자로부터 이름, 나이, 메일을 받아 insert)
while True:
    try:
        name= input('입력할 이름(종료는 0): ')
        if name=='0':
            break;
        age= int(input('입력할 나이: '))
    except:
        print('유효하지 않은 나이를 입력한 경우, 18세로 초기화')
        age=18
    finally:
        email= input('입력할 메일은: ')형
        

    newMember= Member(name, age, email) #qmark방식에서 사용

    sql= "INSERT INTO MEMBER VALUES (:name, :age, :email)"
    cursor.execute(sql, newMember.__dict__)
    conn.commit()
    if cursor.rowcount ==1:
        print('입력성공')
conn.commit()

입력할 이름(종료는 0): 김길자
입력할 나이: 44
입력할 메일은: gil@g.com
입력성공
입력할 이름(종료는 0): 0
입력할 메일은: 0

# 2절 오라클 데이터베이스 연결
- pip install cx_oracle( oracle 11g까지)
- pip install oracledb (oracle 12부터)

In [20]:
! pip install cx_oracle

Collecting cx_oracle
  Downloading cx_Oracle-8.3.0-cp310-cp310-win_amd64.whl (213 kB)
     ------------------------------------- 213.1/213.1 kB 12.7 MB/s eta 0:00:00
Installing collected packages: cx_oracle
Successfully installed cx_oracle-8.3.0

In [21]:
import cx_Oracle
cx_Oracle.__version__

'8.3.0'

In [26]:
# conn 얻어오는 방법1
conn= cx_Oracle.connect("scott","tiger","localhost:1521/xe")
cursor= conn.cursor()
sql= "select * from emp"
cursor.execute(sql)
cursor.fetchall()

[(7369,
  'SMITH',
  'CLERK',
  7902,
  datetime.datetime(1980, 12, 17, 0, 0),
  800.0,
  None,
  20),
 (7499,
  'ALLEN',
  'SALESMAN',
  7698,
  datetime.datetime(1981, 2, 20, 0, 0),
  1600.0,
  300.0,
  30),
 (7521,
  'WARD',
  'SALESMAN',
  7698,
  datetime.datetime(1981, 2, 22, 0, 0),
  1250.0,
  500.0,
  30),
 (7566,
  'JONES',
  'MANAGER',
  7839,
  datetime.datetime(1981, 4, 2, 0, 0),
  2975.0,
  None,
  20),
 (7654,
  'MARTIN',
  'SALESMAN',
  7698,
  datetime.datetime(1981, 9, 28, 0, 0),
  1250.0,
  1400.0,
  30),
 (7698,
  'BLAKE',
  'MANAGER',
  7839,
  datetime.datetime(1981, 5, 1, 0, 0),
  2850.0,
  None,
  30),
 (7782,
  'CLARK',
  'MANAGER',
  7839,
  datetime.datetime(1981, 6, 9, 0, 0),
  2450.0,
  None,
  10),
 (7788,
  'SCOTT',
  'ANALYST',
  7566,
  datetime.datetime(1982, 12, 9, 0, 0),
  3000.0,
  None,
  20),
 (7839,
  'KING',
  'PRESIDENT',
  None,
  datetime.datetime(1981, 11, 17, 0, 0),
  5000.0,
  None,
  10),
 (7844,
  'TURNER',
  'SALESMAN',
  7698,
  datetime.datetime(1981, 9, 8, 0, 0),
  1500.0,
  0.0,
  30),
 (7876,
  'ADAMS',
  'CLERK',
  7788,
  datetime.datetime(1983, 1, 12, 0, 0),
  1100.0,
  None,
  20),
 (7900,
  'JAMES',
  'CLERK',
  7698,
  datetime.datetime(1981, 12, 3, 0, 0),
  950.0,
  None,
  30),
 (7902,
  'FORD',
  'ANALYST',
  7566,
  datetime.datetime(1981, 12, 3, 0, 0),
  3000.0,
  None,
  20),
 (7934,
  'MILLER',
  'CLERK',
  7782,
  datetime.datetime(1982, 1, 23, 0, 0),
  1300.0,
  None,
  10)]

In [27]:
! pip install oracledb

Collecting oracledb
  Downloading oracledb-3.4.1-cp310-cp310-win_amd64.whl (1.8 MB)
     ---------------------------------------- 1.8/1.8 MB 10.6 MB/s eta 0:00:00
Requirement already satisfied: cryptography>=3.2.1 in c:\users\admin\anaconda3\lib\site-packages (from oracledb) (39.0.1)
Requirement already satisfied: typing_extensions>=4.14.0 in c:\users\admin\anaconda3\lib\site-packages (from oracledb) (4.15.0)
Requirement already satisfied: cffi>=1.12 in c:\users\admin\anaconda3\lib\site-packages (from cryptography>=3.2.1->oracledb) (1.15.1)
Requirement already satisfied: pycparser in c:\users\admin\anaconda3\lib\site-packages (from cffi>=1.12->cryptography>=3.2.1->oracledb) (2.21)
Installing collected packages: oracledb
Successfully installed oracledb-3.4.1

In [33]:
# conn 얻어오는 방법2
import oracledb
oracledb.init_oracle_client()

# conn= cx_Oracle.connect("scott"/"tiger"//"localhost:1521/xe")
conn= oracledb.connect(
    user='Scott',
    password='tiger',
    host='localhost',
    port=1521,
    sid="xe"
)
cursor= conn.cursor()
sql= "select EMPNO NO, ENAME, JOB, MGR, HIREDATE, SAL, COMM, DEPTNO FROM EMP"
cursor.execute(sql)
emp= cursor.fetchall()
print(emp)

[(7369, 'SMITH', 'CLERK', 7902, datetime.datetime(1980, 12, 17, 0, 0), 800.0, None, 20), (7499, 'ALLEN', 'SALESMAN', 7698, datetime.datetime(1981, 2, 20, 0, 0), 1600.0, 300.0, 30), (7521, 'WARD', 'SALESMAN', 7698, datetime.datetime(1981, 2, 22, 0, 0), 1250.0, 500.0, 30), (7566, 'JONES', 'MANAGER', 7839, datetime.datetime(1981, 4, 2, 0, 0), 2975.0, None, 20), (7654, 'MARTIN', 'SALESMAN', 7698, datetime.datetime(1981, 9, 28, 0, 0), 1250.0, 1400.0, 30), (7698, 'BLAKE', 'MANAGER', 7839, datetime.datetime(1981, 5, 1, 0, 0), 2850.0, None, 30), (7782, 'CLARK', 'MANAGER', 7839, datetime.datetime(1981, 6, 9, 0, 0), 2450.0, None, 10), (7788, 'SCOTT', 'ANALYST', 7566, datetime.datetime(1982, 12, 9, 0, 0), 3000.0, None, 20), (7839, 'KING', 'PRESIDENT', None, datetime.datetime(1981, 11, 17, 0, 0), 5000.0, None, 10), (7844, 'TURNER', 'SALESMAN', 7698, datetime.datetime(1981, 9, 8, 0, 0), 1500.0, 0.0, 30), (7876, 'ADAMS', 'CLERK', 7788, datetime.datetime(1983, 1, 12, 0, 0), 1100.0, None, 20), (7900, 'JAMES', 'CLERK', 7698, datetime.datetime(1981, 12, 3, 0, 0), 950.0, None, 30), (7902, 'FORD', 'ANALYST', 7566, datetime.datetime(1981, 12, 3, 0, 0), 3000.0, None, 20), (7934, 'MILLER', 'CLERK', 7782, datetime.datetime(1982, 1, 23, 0, 0), 1300.0, None, 10)]

In [34]:
import pandas as pd
emp_df= pd.DataFrame(emp)
emp_df

       0       1          2       3          4       5       6   7
0   7369   SMITH      CLERK  7902.0 1980-12-17   800.0     NaN  20
1   7499   ALLEN   SALESMAN  7698.0 1981-02-20  1600.0   300.0  30
2   7521    WARD   SALESMAN  7698.0 1981-02-22  1250.0   500.0  30
3   7566   JONES    MANAGER  7839.0 1981-04-02  2975.0     NaN  20
4   7654  MARTIN   SALESMAN  7698.0 1981-09-28  1250.0  1400.0  30
5   7698   BLAKE    MANAGER  7839.0 1981-05-01  2850.0     NaN  30
6   7782   CLARK    MANAGER  7839.0 1981-06-09  2450.0     NaN  10
7   7788   SCOTT    ANALYST  7566.0 1982-12-09  3000.0     NaN  20
8   7839    KING  PRESIDENT     NaN 1981-11-17  5000.0     NaN  10
9   7844  TURNER   SALESMAN  7698.0 1981-09-08  1500.0     0.0  30
10  7876   ADAMS      CLERK  7788.0 1983-01-12  1100.0     NaN  20
11  7900   JAMES      CLERK  7698.0 1981-12-03   950.0     NaN  30
12  7902    FORD    ANALYST  7566.0 1981-12-03  3000.0     NaN  20
13  7934  MILLER      CLERK  7782.0 1982-01-23  1300.0     NaN  10

In [35]:
# SELECT문을 수행한 필드 정보 (no, ename, job~~~)
cursor.description

[('NO', <DbType DB_TYPE_NUMBER>, 5, None, 4, 0, False),
 ('ENAME', <DbType DB_TYPE_VARCHAR>, 10, 10, None, None, True),
 ('JOB', <DbType DB_TYPE_VARCHAR>, 9, 9, None, None, True),
 ('MGR', <DbType DB_TYPE_NUMBER>, 5, None, 4, 0, True),
 ('HIREDATE', <DbType DB_TYPE_DATE>, 23, None, None, None, True),
 ('SAL', <DbType DB_TYPE_NUMBER>, 11, None, 7, 2, True),
 ('COMM', <DbType DB_TYPE_NUMBER>, 11, None, 7, 2, True),
 ('DEPTNO', <DbType DB_TYPE_NUMBER>, 3, None, 2, 0, True)]

In [36]:
[description[0] for description in cursor.description ]

['NO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO']

In [37]:
emp_df.columns=[description[0] for description in cursor.description ]
emp_df.head()

     NO   ENAME       JOB     MGR   HIREDATE     SAL    COMM  DEPTNO
0  7369   SMITH     CLERK  7902.0 1980-12-17   800.0     NaN      20
1  7499   ALLEN  SALESMAN  7698.0 1981-02-20  1600.0   300.0      30
2  7521    WARD  SALESMAN  7698.0 1981-02-22  1250.0   500.0      30
3  7566   JONES   MANAGER  7839.0 1981-04-02  2975.0     NaN      20
4  7654  MARTIN  SALESMAN  7698.0 1981-09-28  1250.0  1400.0      30

In [39]:
# 검색할 이름을 사용자에게 받아 해당 내용을 출력
ename= input('검색할 이름은? ').upper()
sql= "select * from emp where ename = :ename"
cursor.execute(sql,(ename, ))
emp = cursor.fetchall()
if emp:
    print(emp[0])
else:
    print('입력하신 이름의 데이터는 없습니다.')

검색할 이름은? scott
(7788, 'SCOTT', 'ANALYST', 7566, datetime.datetime(1982, 12, 9, 0, 0), 3000.0, None, 20)

In [40]:
fieldnames= [descrip[0] for descrip in cursor.description]
fieldnames

['EMPNO', 'ENAME', 'JOB', 'MGR', 'HIREDATE', 'SAL', 'COMM', 'DEPTNO']

In [41]:
for fieldname, data in zip (fieldnames, emp[0]):
    print(f"{fieldname}:{data if data is not None else '-'}")

EMPNO:7788
ENAME:SCOTT
JOB:ANALYST
MGR:7566
HIREDATE:1982-12-09 00:00:00
SAL:3000.0
COMM:None
DEPTNO:20

# 3절 My SQL데이터 베이스 연결
- pip install mysql-connector-python (공식 connector)
- pip install PyMySQL (경량)

In [43]:
!pip install mysql-connector-python

Collecting mysql-connector-python
  Downloading mysql_connector_python-9.5.0-cp310-cp310-win_amd64.whl (16.5 MB)
     ---------------------------------------- 16.5/16.5 MB 7.4 MB/s eta 0:00:00
Installing collected packages: mysql-connector-python
Successfully installed mysql-connector-python-9.5.0

In [44]:
!pip install pymysql

Collecting pymysql
  Downloading pymysql-1.1.2-py3-none-any.whl (45 kB)
     ---------------------------------------- 45.3/45.3 kB ? eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.2

In [19]:
import pymysql
conn = pymysql.connect(
    host = "localhost",
    port = 3306,
    user="root",
    password="1026",
    db="devdb",
    charset="utf8mb4"
)
cursor = conn.cursor()
sql = "SELECT * FROM PERSONAL"
cursor.execute(sql)
personal = cursor.fetchall()
personal

((1001, 'bill', 'president', None, datetime.date(1989, 1, 10), 7000, None, 10),
 (1111, 'smith', 'manager', 1001, datetime.date(1990, 12, 17), 1000, None, 10),
 (1112, 'ally', 'salesman', 1116, datetime.date(1991, 2, 20), 1600, 500, 30),
 (1113, 'word', 'salesman', 1116, datetime.date(1992, 2, 24), 1450, 300, 30),
 (1114, 'james', 'manager', 1001, datetime.date(1990, 4, 12), 3975, None, 20),
 (1116, 'johnson', 'manager', 1001, datetime.date(1991, 5, 1), 3550, None, 30),
 (1118, 'martin', 'analyst', 1111, datetime.date(1991, 9, 9), 3450, None, 10),
 (1121, 'kim', 'clerk', 1114, datetime.date(1990, 12, 8), 4000, None, 20),
 (1123, 'lee', 'salesman', 1116, datetime.date(1991, 9, 23), 1200, 0, 30),
 (1226, 'park', 'analyst', 1111, datetime.date(1990, 1, 3), 2500, None, 10))

In [10]:
cursor.execute("select database();")
print(cursor.fetchone())

('devdb',)

In [2]:
def load_cursor():
    global conn
    global cursor
    import oracledb
    oracledb.init_oracle_client()
    conn= oracledb.connect("scott/tiger@localhost:1521/xe")
    cursor = conn.cursor()
load_cursor()

In [12]:
import pandas as pd

def fn1_insert_member_info():
    
    '입력받은 데이터를 member테이블에 입력'
    cursor=conn.cursor()
    name= input('이름: ')
    tel= input('전화: ')
    email= input('이메일: ')
    try:
        age=int(input("나이: "))
    except:
        print('유효하지 않은 나이 입력시 나이는 0으로 초기화')
        age= 0
    try:
        grade = int(input('등급'))
        if grade<1:
            grade=1
        elif grade>5:
            grade=5
    except:
        print('유효하지 않은 등급 입력시 등급은 1로 초기화')
        grade=1
    etc = input("기타정보: ")
    
    sql= "INSERT INTO MEMBER VALUES (:name, :tel, :email, :age, :grade, :etc)"
    inputdata= {'name':name, 'tel':tel, 'email':email, 'age':age, 'grade':grade, 'etc':etc}
    cursor.execute(sql, inputdata)
    conn.commit()
    if cursor.rowcount==1:
        print(name, '님 가입완료')
    cursor.close()
fn1_insert_member_info()

이름: 이희성
전화: 010-5675-6361
이메일: l@l.com
나이: 23
등급1
기타정보: etc
이희성 님 가입완료

## 2. 전체조회

In [23]:
def fn2_print_members():
    'member 테이블의 내용을 데이터 프레임으로 display'
    cursor = conn.cursor()
    sql= "select * from member order by name"
    cursor.execute(sql)
    fieldnames= [descrip[0] for descrip in cursor.description]
    df= pd.DataFrame(cursor.fetchall(), columns=fieldnames)
    display(df)
    cursor.close()
fn2_print_members()

  NAME            TEL    EMAIL  AGE  GRADE  ETC
0  홍길동  010-9999-9999  H@H.COM   33      2  까칠해

##  3. 이름조회

In [24]:
def fn3_search_member():
    '찾고자하는 이름을 input으로 받아 해당 내용을 데이터 프레임으로 display'
    cursor = conn.cursor()
    name= input("찾고자 하는 이름: ")    
    sql= "select * from member where name=:name"
    cursor.execute(sql, {'name':name})
    fieldnames= [descrip[0] for descrip in cursor.description]
    df= pd.DataFrame(cursor.fetchall(), columns=fieldnames)
    display(df)
    cursor.close()
fn3_search_member()

찾고자 하는 이름: 이희성

Empty DataFrame
Columns: [NAME, TEL, EMAIL, AGE, GRADE, ETC]
Index: []

## 4.메일삭제

In [22]:
def fn4_delete_member():
    '삭제하고자 하는 메일을 input으로 받아 해당 행을 삭제'
    cursor = conn.cursor()
    email= input("삭제하고자하는 이메일: ")    
    
    sql= "delete from member where email=:email"
    cursor.execute(sql, {'email':email})
    conn.commit()

    if cursor.rowcount > 1:
        print('해당이메일존재 ')
    else:
        print('해당이메일이 존재하지 않는다')
    
    cursor.close()
fn4_delete_member()

삭제하고자하는 이메일: 1
해당이메일이 존재하지 않는다

## 5.csv내보내기

In [26]:
def fn5_save_csv():
    'member 테이블 내용을 csv로 내보내기'
    cursor = conn.cursor()
    sql = "SELECT * FROM member"
    cursor.execute(sql)

    # 컬럼명 가져오기
    fieldnames = [col[0] for col in cursor.description]

    # 모든 데이터 가져오기
    rows = cursor.fetchall()

    # DataFrame 생성
    df = pd.DataFrame(rows, columns=fieldnames)

    # CSV 저장
    filename = "member_table.csv"
    df.to_csv('data/ch15_문제.csv',index=False)

    cursor.close()

In [27]:
load_cursor()
while True:
    menu = input("1.회원입력 | 2.전체조회 | 3.이름찾기 | 4.메일삭제 | 5.CSV내보내기 | 0.종료")
    if menu=='1':
        fn1_insert_member_info()
    elif menu=='2':
        fn2_print_members()
    elif menu=='3':
        fn3_search_member()
    elif menu=='4':
        fn4_delete_member()
    elif menu=='5':
        fn5_save_csv()
    elif menu=='0':
        conn.close()
        break
    else:
        print('유효한 메뉴 번호를 입력해 주세요')

1.회원입력 | 2.전체조회 | 3.이름찾기 | 4.메일삭제 | 5.CSV내보내기 | 0.종료1
이름: 홍길동
전화: 010-1111-2222
이메일: h@ho.com
나이: 23
등급1
기타정보: etc
홍길동 님 가입완료
1.회원입력 | 2.전체조회 | 3.이름찾기 | 4.메일삭제 | 5.CSV내보내기 | 0.종료2

  NAME            TEL     EMAIL  AGE  GRADE  ETC
0  홍길동  010-1111-2222  h@ho.com   23      1  etc
1  홍길동  010-9999-9999   H@H.COM   33      2  까칠해

1.회원입력 | 2.전체조회 | 3.이름찾기 | 4.메일삭제 | 5.CSV내보내기 | 0.종료이길동
유효한 메뉴 번호를 입력해 주세요
1.회원입력 | 2.전체조회 | 3.이름찾기 | 4.메일삭제 | 5.CSV내보내기 | 0.종료1
이름: 이길동
전화: 010-4567-8978
이메일: le@e.com
나이: 24
등급1
기타정보: etc
이길동 님 가입완료
1.회원입력 | 2.전체조회 | 3.이름찾기 | 4.메일삭제 | 5.CSV내보내기 | 0.종료2

  NAME            TEL     EMAIL  AGE  GRADE  ETC
0  이길동  010-4567-8978  le@e.com   24      1  etc
1  홍길동  010-1111-2222  h@ho.com   23      1  etc
2  홍길동  010-9999-9999   H@H.COM   33      2  까칠해

1.회원입력 | 2.전체조회 | 3.이름찾기 | 4.메일삭제 | 5.CSV내보내기 | 0.종료1
이름: 이희성
전화: 010-5675-6361
이메일: dlgmltjd3353@gmail.com
나이: 23
등급1
기타정보: 없음
이희성 님 가입완료
1.회원입력 | 2.전체조회 | 3.이름찾기 | 4.메일삭제 | 5.CSV내보내기 | 0.종료2

  NAME            TEL                   EMAIL  AGE  GRADE  ETC
0  이길동  010-4567-8978                le@e.com   24      1  etc
1  이희성  010-5675-6361  dlgmltjd3353@gmail.com   23      1   없음
2  홍길동  010-1111-2222                h@ho.com   23      1  etc
3  홍길동  010-9999-9999                 H@H.COM   33      2  까칠해

1.회원입력 | 2.전체조회 | 3.이름찾기 | 4.메일삭제 | 5.CSV내보내기 | 0.종료3
찾고자 하는 이름: 이희성

  NAME            TEL                   EMAIL  AGE  GRADE ETC
0  이희성  010-5675-6361  dlgmltjd3353@gmail.com   23      1  없음

1.회원입력 | 2.전체조회 | 3.이름찾기 | 4.메일삭제 | 5.CSV내보내기 | 0.종료5
1.회원입력 | 2.전체조회 | 3.이름찾기 | 4.메일삭제 | 5.CSV내보내기 | 0.종료0